spec/fixtures/campaign_management/update_conversion_goals/standard.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:ns0="https://bingads.microsoft.com/CampaignManagement/v13" xmlns:ns1="http://schemas.microsoft.com/2003/10/Serialization/Arrays" xmlns:ns2="http://schemas.datacontract.org/2004/07/System.Collections.Generic" xmlns:ns3="http://schemas.datacontract.org/2004/07/System" xmlns:ns4="https://adapi.microsoft.com" xmlns:ns5="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <ns0:AuthenticationToken>***FILTERED***</ns0:AuthenticationToken>
    <ns0:DeveloperToken>***FILTERED***</ns0:DeveloperToken>
    <ns0:CustomerId>***FILTERED***</ns0:CustomerId>
    <ns0:CustomerAccountId>***FILTERED***</ns0:CustomerAccountId>
  </soap:Header>
  <soap:Body>
    <ns0:UpdateConversionGoalsRequest>
      <ns0:ConversionGoals>
        <ns0:ConversionGoal xsi:type="ns0:EventGoal">
          <ns0:ConversionWindowInMinutes>43200</ns0:ConversionWindowInMinutes>
          <ns0:CountType>Unique</ns0:CountType>
          <ns0:Id>46068449</ns0:Id>
          <ns0:Name>updated sdk test</ns0:Name>
          <ns0:Revenue>
            <ns0:Type>NoValue</ns0:Type>
          </ns0:Revenue>
          <ns0:TagId>96031109</ns0:TagId>
          <ns0:ActionExpression>contact_form</ns0:ActionExpression>
          <ns0:ActionOperator>Equals</ns0:ActionOperator>
        </ns0:ConversionGoal>
      </ns0:ConversionGoals>
    </ns0:UpdateConversionGoalsRequest>
  </soap:Body>
</soap:Envelope>